tap "clojure/tools"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "michaeleisel/zld"
brew "sqlite"
brew "ansible"
brew "awscli"
brew "cocoapods"
brew "qemu"
brew "colima"
brew "coreutils"
brew "cowsay"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "harfbuzz"
brew "ffmpeg"
brew "figlet"
brew "flyctl"
brew "fzf"
brew "gh"
brew "pinentry"
brew "gnupg"
brew "gnuplot"
brew "jadx"
brew "jenv"
brew "jq"
brew "leiningen"
brew "less"
brew "mas"
brew "maven"
brew "netcat"
brew "node"
brew "nvm"
brew "postgresql@15"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rust"
brew "sbt"
brew "scc"
brew "shellcheck"
brew "wireshark", link: false
brew "yarn"
brew "youtube-dl"
brew "clojure/tools/clojure"
brew "heroku/brew/heroku"
cask "1password"
cask "algodoo"
cask "audacity"
cask "blender"
cask "burp-suite"
cask "codeql"
cask "discord"
cask "firefox"
cask "flutter"
cask "gimp"
cask "google-chrome"
cask "inkscape"
cask "maltego"
cask "obs"
cask "openvpn-connect"
cask "postgres-unofficial"
cask "slack"
cask "spotify"
cask "synthesia"
cask "vcv-rack"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "xquartz"
cask "zap"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
