tap "clojure/tools"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "openssl@1.1"
brew "sqlite"
brew "ansible"
brew "awscli"
brew "cocoapods", link: false
brew "harfbuzz"
brew "ffmpeg"
brew "gh"
brew "pinentry"
brew "gnupg"
brew "gnuplot"
brew "jenv"
brew "jq"
brew "leiningen"
brew "mas"
brew "maven"
brew "netcat"
brew "node"
brew "nvm"
brew "postgresql"
brew "pyenv"
brew "redis", restart_service: true
brew "rust"
brew "sbt"
brew "scc"
brew "shellcheck"
brew "wireshark", link: false
brew "yarn"
brew "clojure/tools/clojure"
brew "heroku/brew/heroku"
cask "algodoo"
cask "audacity"
cask "blender"
cask "docker"
cask "firefox"
cask "flutter"
cask "google-chrome"
cask "inkscape"
cask "obs"
cask "obsidian"
cask "openvpn-connect"
cask "postgres-unofficial"
cask "slack"
cask "spotify"
cask "vcv-rack"
cask "viscosity"
cask "visual-studio-code"
cask "wireshark"
cask "xquartz"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
