anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
esbenp.prettier-vscode
google.gemini-cli-vscode-ide-companion
hashicorp.terraform
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.makefile-tools
openai.chatgpt
rust-lang.rust-analyzer
stkb.rewrap
vadimcn.vscode-lldb
