dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
esbenp.prettier-vscode
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
openai.chatgpt
rust-lang.rust-analyzer
stkb.rewrap
vadimcn.vscode-lldb
