alexcvzz.vscode-sqlite
avli.clojure
bbenoist.Nix
betterthantomorrow.calva
betterthantomorrow.calva-spritz
bitlang.cobol
borkdude.clj-kondo
Dart-Code.dart-code
Dart-Code.flutter
dbaeumer.vscode-eslint
dtsvet.vscode-wasm
eamodio.gitlens
esbenp.prettier-vscode
fcrespo82.markdown-table-formatter
GitHub.copilot
GitHub.copilot-chat
GitHub.vscode-codeql
golang.go
hbenl.vscode-test-explorer
ms-ossdata.vscode-postgresql
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
ms-vscode.vscode-typescript-tslint-plugin
rebornix.ruby
redhat.vscode-yaml
rust-lang.rust-analyzer
stkb.rewrap
stylelint.vscode-stylelint
timonwong.shellcheck
Tyriar.lorem-ipsum
vadimcn.vscode-lldb
vscode-org-mode.org-mode
Vue.volar
wengerk.highlight-bad-chars
wingrunr21.vscode-ruby
