alexcvzz.vscode-sqlite
bbenoist.nix
betterthantomorrow.calva
betterthantomorrow.calva-spritz
bitlang.cobol
borkdude.clj-kondo
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
dtsvet.vscode-wasm
eamodio.gitlens
esbenp.prettier-vscode
fcrespo82.markdown-table-formatter
github.copilot
github.copilot-chat
github.vscode-codeql
golang.go
hbenl.vscode-test-explorer
inferrinizzard.prettier-sql-vscode
ms-ossdata.vscode-postgresql
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
redhat.vscode-yaml
rust-lang.rust-analyzer
stkb.rewrap
stylelint.vscode-stylelint
timonwong.shellcheck
tyriar.lorem-ipsum
vadimcn.vscode-lldb
vscode-org-mode.org-mode
vue.volar
wengerk.highlight-bad-chars
