alexcvzz.vscode-sqlite
avli.clojure
bbenoist.Nix
betterthantomorrow.calva
bitlang.cobol
borkdude.clj-kondo
Dart-Code.dart-code
Dart-Code.flutter
dbaeumer.vscode-eslint
dtsvet.vscode-wasm
eamodio.gitlens
esbenp.prettier-vscode
fcrespo82.markdown-table-formatter
GitHub.copilot
golang.go
ms-ossdata.vscode-postgresql
ms-vscode.makefile-tools
ms-vscode.vscode-typescript-tslint-plugin
rebornix.ruby
redhat.vscode-yaml
rust-lang.rust
rust-lang.rust-analyzer
stkb.rewrap
stylelint.vscode-stylelint
timonwong.shellcheck
Tyriar.lorem-ipsum
vadimcn.vscode-lldb
vscode-org-mode.org-mode
wengerk.highlight-bad-chars
wingrunr21.vscode-ruby
